ojari/msp430/main.c
/**
 * Copyright 2014 Jari Ojanen
 */
#include <msp430.h>
#include <stdio.h>
#include "main.h"
#include "config.h"

unsigned int g_event = 0;

callback cb_timer1 = NULL;
callback cb_timer2 = NULL;
callback cb_timer3 = NULL;

unsigned char g_rtc_wday = 0;
unsigned char g_rtc_hour = 22;
unsigned char g_rtc_min = 0;
unsigned char g_rtc_sec = 0;


__attribute__ ((__interrupt__(TIMER0_A0_VECTOR)))
static void timer1_isr()
{
	g_event |= EV_TIMER1;
	__bic_SR_register_on_exit(LPM0_bits);
} 

__attribute__ ((__interrupt__(TIMER1_A0_VECTOR)))
static void timer2_isr()
{
	g_event |= EV_TIMER2;
	__bic_SR_register_on_exit(LPM0_bits);
} 

__attribute__ ((__interrupt__(WDT_VECTOR)))
static void timer3_isr()
{
	g_rtc_sec++;
	if (g_rtc_sec > 59) {
		g_rtc_sec = 0;
		g_rtc_min++;
		if (g_rtc_min > 59) {
			g_rtc_min = 0;
			g_rtc_hour++;
			if (g_rtc_hour > 23) {
				g_rtc_hour = 0;
				g_rtc_wday++;
				if (g_rtc_wday > 6) {
					g_rtc_wday = 0;
				}
			}
		}
	}
	//toggle_LED_RED;
	g_event |= EV_TIMER3;
	__bic_SR_register_on_exit(LPM0_bits);
} 

__attribute__((__interrupt__(PORT1_VECTOR)))
static void port1_isr()
{
	g_event |= EV_PORT1;
	__bic_SR_register_on_exit(LPM0_bits);
} 

__attribute__((__interrupt__(PORT2_VECTOR)))
static void port2_isr()
{
	g_event |= EV_PORT2;
	__bic_SR_register_on_exit(LPM0_bits);
} 

__attribute__((__interrupt__(USCIAB0TX_VECTOR)))
static void usci_tx_isr()
{
	g_event |= EV_TX;
	__bic_SR_register_on_exit(LPM0_bits);
} 

__attribute__((__interrupt__(USCIAB0RX_VECTOR)))
static void usci_rx_isr()
{
	g_event |= EV_RX;
	__bic_SR_register_on_exit(LPM0_bits);
} 

void uart_init()
{
#define TX BIT2
#define RX BIT1

	P1SEL  |= RX + TX;
	P1SEL2 |= RX + TX;

	UCA0CTL1 |= UCSSEL_2; // SMCLK
	UCA0BR0 = 104;        // 9600 baud
	UCA0BR1 = 0;
	UCA0MCTL = UCBRS0; // modulation
	//UCA0MCTL = UCBRS2 + UCBRS0; // modulation
	UCA0CTL1 &= ~UCSWRST;
	UC0IE |= UCA0RXIE;
}

void uart_ch(char ch)
{
	while ( !(IFG2 & UCA0TXIFG));
	UCA0TXBUF = ch;
}

void uart_str(char *str)
{
    while(*str) {
		while ( !(IFG2 & UCA0TXIFG));
		UCA0TXBUF = *str;
        str++;
    }
}

void uart_num(uint8_t num)
{
	char digit0, digit1, digit2='0';

	digit0 = '0'+(num % 10);
	num /= 10;
	digit1 = '0'+(num % 10);

	if (num > 10) {
		num /= 10;
		digit2 = '0'+(num % 10);
		uart_ch(digit2);
	}
	uart_ch(digit1);
	uart_ch(digit0);
}

//------------------------------------------------------------------------------
int main()
{
	WDTCTL = WDTPW + WDTHOLD;             // Stop watchdog timer
#if 1
	BCSCTL2 = SELM_0 | DIVM_0 | DIVS_0;
	DCOCTL = 0x00;
	BCSCTL1 = CALBC1_1MHZ;
	DCOCTL = CALDCO_1MHZ;

	BCSCTL1 |= XT2OFF | DIVA_0;
	BCSCTL3 = XT2S_0 | LFXT1S_0 | XCAP_1;

	/*do {
        IFG1 &= ~OFIFG; // Clear OSC fault flag
        __delay_cycles(50);  // 50us delay
    } while (IFG1 & OFIFG);
	*/
	WDTCTL = WDTPW | WDTTMSEL | WDTSSEL;
#else
	BCSCTL3 |= LFXT1S_2;                  // VLOCLK

	BCSCTL1 = CALBC1_1MHZ;                // Set DCO to calibrated 1 MHz.
	DCOCTL = CALDCO_1MHZ;

	//BCSCTL1 |= DIVA_0;  // ACLK / 8
	BCSCTL3 |= XCAP_3;
#endif
	// Init timer1
	//
	TA0CCR0   = 0x7FFF;
	TA0CCTL0  = CCIE;
	TA0CTL = TASSEL_1 + MC_1 + ID_0; // ACLK, up to CCR0, divider /1

	// Init timer2
	//
	TA1CCR0   = 0x3FFF;
	TA1CCTL0  = CCIE;
	TA1CTL = TASSEL_1 + MC_1 + ID_0; // ACLK, up to CCR0, divider /1

	// Init timer3
	//
	WDTCTL = WDT_ADLY_1000;
	IE1 |= WDTIE;

	uart_init();

	// main loop
	//
	config_port_init();
	app_init();


	uart_num(BCSCTL1);
	uart_str("main\n");

	//if (BCSCTL3 & LFXT1OF)
	//	uart_str("osc fault\n");

	//__enable_interrupt();
	while (1) {
		if (g_event == 0)
			__bis_SR_register(LPM0_bits + GIE);

		if (g_event & EV_TIMER1) {
			if (cb_timer1)
				cb_timer1();
			g_event &= ~EV_TIMER1;
		}
		if (g_event & EV_TIMER2) {
			if (cb_timer2)
				cb_timer2();
			g_event &= ~EV_TIMER2;
		}
		if (g_event & EV_TIMER3) {
			if (cb_timer3)
				cb_timer3();
			g_event &= ~EV_TIMER3;
		}
			
	}
	return 0;
}
